{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Stored 'data' (bool)\n"
     ]
    }
   ],
   "source": [
    "# Parámetro para generar el modelo del taggeador\n",
    "data = False\n",
    "%store data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 2.28 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "%run ./carga_diputados.ipynb"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "False\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Palabras procesadas: 100%|██████████| 22330/22330 [03:15<00:00, 114.10it/s]\n",
      "Documentos.....: 100%|██████████| 10/10 [43:57<00:00, 263.76s/it] "
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wall time: 47min 50s\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "%run ./carga_dialogos.ipynb"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j_connector as nc\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = nc.generate_graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "grupos_parlamentarios = list(graph.run('MATCH (d:Diputado) RETURN DISTINCT(d.grupo) AS grupo ORDER BY grupo ASC').to_data_frame()['grupo'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### OBTENEMOS LISTA DE RELACIONES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = 'MATCH ()-[relation]-() RETURN DISTINCT(relation.pleno) as sesion order by sesion asc'\n",
    "sesiones = graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def lista_palabras(grupo, plenos):\n",
    "    query = \"MATCH (d:Diputado)-[rel]-(p:Palabra) \"\n",
    "    query = query + \"WHERE d.grupo = '\" + grupo +\"' \"\n",
    "    query = query + \"AND rel.pleno IN \" + str(plenos) + \" \"\n",
    "    query = query + \"RETURN rel.pleno, d.grupo, p.palabra, SUM(rel.veces) as veces \"\n",
    "    query = query + \"ORDER BY veces DESC LIMIT 15\"\n",
    "    return graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SESION...... 00_INVESTIDURA\n",
      "Grupo Ciudadanos\n",
      "         rel.pleno           d.grupo   p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Ciudadanos     sánchez     79\n",
      "1   00_INVESTIDURA  Grupo Ciudadanos     acuerdo     58\n",
      "2   00_INVESTIDURA  Grupo Ciudadanos      españa     55\n",
      "3   00_INVESTIDURA  Grupo Ciudadanos    gobierno     45\n",
      "4   00_INVESTIDURA  Grupo Ciudadanos   españoles     39\n",
      "5   00_INVESTIDURA  Grupo Ciudadanos     partido     38\n",
      "6   00_INVESTIDURA  Grupo Ciudadanos         día     31\n",
      "7   00_INVESTIDURA  Grupo Ciudadanos    esquerra     30\n",
      "8   00_INVESTIDURA  Grupo Ciudadanos    cataluña     28\n",
      "9   00_INVESTIDURA  Grupo Ciudadanos        país     20\n",
      "10  00_INVESTIDURA  Grupo Ciudadanos  socialista     19\n",
      "11  00_INVESTIDURA  Grupo Ciudadanos       dicho     18\n",
      "12  00_INVESTIDURA  Grupo Ciudadanos     podemos     18\n",
      "13  00_INVESTIDURA  Grupo Ciudadanos         pnv     18\n",
      "14  00_INVESTIDURA  Grupo Ciudadanos       decía     18\n",
      "         rel.pleno           d.grupo   p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Ciudadanos     sánchez     79\n",
      "1   00_INVESTIDURA  Grupo Ciudadanos     acuerdo     58\n",
      "2   00_INVESTIDURA  Grupo Ciudadanos      españa     55\n",
      "3   00_INVESTIDURA  Grupo Ciudadanos    gobierno     45\n",
      "4   00_INVESTIDURA  Grupo Ciudadanos   españoles     39\n",
      "5   00_INVESTIDURA  Grupo Ciudadanos     partido     38\n",
      "6   00_INVESTIDURA  Grupo Ciudadanos         día     31\n",
      "7   00_INVESTIDURA  Grupo Ciudadanos    esquerra     30\n",
      "8   00_INVESTIDURA  Grupo Ciudadanos    cataluña     28\n",
      "9   00_INVESTIDURA  Grupo Ciudadanos        país     20\n",
      "10  00_INVESTIDURA  Grupo Ciudadanos  socialista     19\n",
      "11  00_INVESTIDURA  Grupo Ciudadanos       dicho     18\n",
      "12  00_INVESTIDURA  Grupo Ciudadanos     podemos     18\n",
      "13  00_INVESTIDURA  Grupo Ciudadanos         pnv     18\n",
      "14  00_INVESTIDURA  Grupo Ciudadanos       decía     18\n",
      "Grupo EH Bildu\n",
      "         rel.pleno         d.grupo p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo EH Bildu    euskal     20\n",
      "1   00_INVESTIDURA  Grupo EH Bildu    herria     20\n",
      "2   00_INVESTIDURA  Grupo EH Bildu      años     13\n",
      "3   00_INVESTIDURA  Grupo EH Bildu    agenda     13\n",
      "4   00_INVESTIDURA  Grupo EH Bildu    frente     13\n",
      "5   00_INVESTIDURA  Grupo EH Bildu    crisis     12\n",
      "6   00_INVESTIDURA  Grupo EH Bildu  gobierno     12\n",
      "7   00_INVESTIDURA  Grupo EH Bildu   español     11\n",
      "8   00_INVESTIDURA  Grupo EH Bildu   derecho     10\n",
      "9   00_INVESTIDURA  Grupo EH Bildu   derecha     10\n",
      "10  00_INVESTIDURA  Grupo EH Bildu     vasca     10\n",
      "11  00_INVESTIDURA  Grupo EH Bildu     bildu     10\n",
      "12  00_INVESTIDURA  Grupo EH Bildu      país      9\n",
      "13  00_INVESTIDURA  Grupo EH Bildu     forma      8\n",
      "14  00_INVESTIDURA  Grupo EH Bildu    quiero      8\n",
      "         rel.pleno         d.grupo p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo EH Bildu    euskal     20\n",
      "1   00_INVESTIDURA  Grupo EH Bildu    herria     20\n",
      "2   00_INVESTIDURA  Grupo EH Bildu      años     13\n",
      "3   00_INVESTIDURA  Grupo EH Bildu    agenda     13\n",
      "4   00_INVESTIDURA  Grupo EH Bildu    frente     13\n",
      "5   00_INVESTIDURA  Grupo EH Bildu    crisis     12\n",
      "6   00_INVESTIDURA  Grupo EH Bildu  gobierno     12\n",
      "7   00_INVESTIDURA  Grupo EH Bildu   español     11\n",
      "8   00_INVESTIDURA  Grupo EH Bildu   derecho     10\n",
      "9   00_INVESTIDURA  Grupo EH Bildu   derecha     10\n",
      "10  00_INVESTIDURA  Grupo EH Bildu     vasca     10\n",
      "11  00_INVESTIDURA  Grupo EH Bildu     bildu     10\n",
      "12  00_INVESTIDURA  Grupo EH Bildu      país      9\n",
      "13  00_INVESTIDURA  Grupo EH Bildu     forma      8\n",
      "14  00_INVESTIDURA  Grupo EH Bildu    quiero      8\n",
      "Grupo Mixto\n",
      "         rel.pleno      d.grupo        p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Mixto         gobierno     39\n",
      "1   00_INVESTIDURA  Grupo Mixto          navarra     38\n",
      "2   00_INVESTIDURA  Grupo Mixto           españa     37\n",
      "3   00_INVESTIDURA  Grupo Mixto          sánchez     24\n",
      "4   00_INVESTIDURA  Grupo Mixto          partido     23\n",
      "5   00_INVESTIDURA  Grupo Mixto            bildu     19\n",
      "6   00_INVESTIDURA  Grupo Mixto     constitución     15\n",
      "7   00_INVESTIDURA  Grupo Mixto      investidura     15\n",
      "8   00_INVESTIDURA  Grupo Mixto         político     13\n",
      "9   00_INVESTIDURA  Grupo Mixto        españoles     12\n",
      "10  00_INVESTIDURA  Grupo Mixto  excepcionalidad     11\n",
      "11  00_INVESTIDURA  Grupo Mixto         asturias     11\n",
      "12  00_INVESTIDURA  Grupo Mixto          derecho     11\n",
      "13  00_INVESTIDURA  Grupo Mixto             país     11\n",
      "14  00_INVESTIDURA  Grupo Mixto            votos     11\n",
      "         rel.pleno      d.grupo        p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Mixto         gobierno     39\n",
      "1   00_INVESTIDURA  Grupo Mixto          navarra     38\n",
      "2   00_INVESTIDURA  Grupo Mixto           españa     37\n",
      "3   00_INVESTIDURA  Grupo Mixto          sánchez     24\n",
      "4   00_INVESTIDURA  Grupo Mixto          partido     23\n",
      "5   00_INVESTIDURA  Grupo Mixto            bildu     19\n",
      "6   00_INVESTIDURA  Grupo Mixto     constitución     15\n",
      "7   00_INVESTIDURA  Grupo Mixto      investidura     15\n",
      "8   00_INVESTIDURA  Grupo Mixto         político     13\n",
      "9   00_INVESTIDURA  Grupo Mixto        españoles     12\n",
      "10  00_INVESTIDURA  Grupo Mixto  excepcionalidad     11\n",
      "11  00_INVESTIDURA  Grupo Mixto         asturias     11\n",
      "12  00_INVESTIDURA  Grupo Mixto          derecho     11\n",
      "13  00_INVESTIDURA  Grupo Mixto             país     11\n",
      "14  00_INVESTIDURA  Grupo Mixto            votos     11\n",
      "Grupo Plural\n",
      "         rel.pleno       d.grupo    p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Plural     gobierno     47\n",
      "1   00_INVESTIDURA  Grupo Plural      acuerdo     47\n",
      "2   00_INVESTIDURA  Grupo Plural       españa     44\n",
      "3   00_INVESTIDURA  Grupo Plural         país     32\n",
      "4   00_INVESTIDURA  Grupo Plural      sánchez     31\n",
      "5   00_INVESTIDURA  Grupo Plural     política     26\n",
      "6   00_INVESTIDURA  Grupo Plural      partido     26\n",
      "7   00_INVESTIDURA  Grupo Plural          día     20\n",
      "8   00_INVESTIDURA  Grupo Plural        decir     20\n",
      "9   00_INVESTIDURA  Grupo Plural     cataluña     20\n",
      "10  00_INVESTIDURA  Grupo Plural  investidura     17\n",
      "11  00_INVESTIDURA  Grupo Plural    electoral     16\n",
      "12  00_INVESTIDURA  Grupo Plural     derechos     16\n",
      "13  00_INVESTIDURA  Grupo Plural      diálogo     15\n",
      "14  00_INVESTIDURA  Grupo Plural        dicho     15\n",
      "         rel.pleno       d.grupo    p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Plural     gobierno     47\n",
      "1   00_INVESTIDURA  Grupo Plural      acuerdo     47\n",
      "2   00_INVESTIDURA  Grupo Plural       españa     44\n",
      "3   00_INVESTIDURA  Grupo Plural         país     32\n",
      "4   00_INVESTIDURA  Grupo Plural      sánchez     31\n",
      "5   00_INVESTIDURA  Grupo Plural     política     26\n",
      "6   00_INVESTIDURA  Grupo Plural      partido     26\n",
      "7   00_INVESTIDURA  Grupo Plural          día     20\n",
      "8   00_INVESTIDURA  Grupo Plural        decir     20\n",
      "9   00_INVESTIDURA  Grupo Plural     cataluña     20\n",
      "10  00_INVESTIDURA  Grupo Plural  investidura     17\n",
      "11  00_INVESTIDURA  Grupo Plural    electoral     16\n",
      "12  00_INVESTIDURA  Grupo Plural     derechos     16\n",
      "13  00_INVESTIDURA  Grupo Plural      diálogo     15\n",
      "14  00_INVESTIDURA  Grupo Plural        dicho     15\n",
      "Grupo Podemos\n",
      "         rel.pleno        d.grupo   p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Podemos      españa     37\n",
      "1   00_INVESTIDURA  Grupo Podemos        país     26\n",
      "2   00_INVESTIDURA  Grupo Podemos    gobierno     26\n",
      "3   00_INVESTIDURA  Grupo Podemos     derecha     21\n",
      "4   00_INVESTIDURA  Grupo Podemos     próximo     16\n",
      "5   00_INVESTIDURA  Grupo Podemos  democracia     15\n",
      "6   00_INVESTIDURA  Grupo Podemos        años     15\n",
      "7   00_INVESTIDURA  Grupo Podemos      quiero     15\n",
      "8   00_INVESTIDURA  Grupo Podemos     partido     13\n",
      "9   00_INVESTIDURA  Grupo Podemos       gente     13\n",
      "10  00_INVESTIDURA  Grupo Podemos    sociales     13\n",
      "11  00_INVESTIDURA  Grupo Podemos     posible     13\n",
      "12  00_INVESTIDURA  Grupo Podemos    derechos     12\n",
      "13  00_INVESTIDURA  Grupo Podemos    político     12\n",
      "14  00_INVESTIDURA  Grupo Podemos      década     11\n",
      "         rel.pleno        d.grupo   p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Podemos      españa     37\n",
      "1   00_INVESTIDURA  Grupo Podemos        país     26\n",
      "2   00_INVESTIDURA  Grupo Podemos    gobierno     26\n",
      "3   00_INVESTIDURA  Grupo Podemos     derecha     21\n",
      "4   00_INVESTIDURA  Grupo Podemos     próximo     16\n",
      "5   00_INVESTIDURA  Grupo Podemos  democracia     15\n",
      "6   00_INVESTIDURA  Grupo Podemos        años     15\n",
      "7   00_INVESTIDURA  Grupo Podemos      quiero     15\n",
      "8   00_INVESTIDURA  Grupo Podemos     partido     13\n",
      "9   00_INVESTIDURA  Grupo Podemos       gente     13\n",
      "10  00_INVESTIDURA  Grupo Podemos    sociales     13\n",
      "11  00_INVESTIDURA  Grupo Podemos     posible     13\n",
      "12  00_INVESTIDURA  Grupo Podemos    derechos     12\n",
      "13  00_INVESTIDURA  Grupo Podemos    político     12\n",
      "14  00_INVESTIDURA  Grupo Podemos      década     11\n",
      "Grupo Popular\n",
      "         rel.pleno        d.grupo     p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Popular       sánchez     59\n",
      "1   00_INVESTIDURA  Grupo Popular        españa     55\n",
      "2   00_INVESTIDURA  Grupo Popular       partido     40\n",
      "3   00_INVESTIDURA  Grupo Popular      gobierno     40\n",
      "4   00_INVESTIDURA  Grupo Popular  constitución     26\n",
      "5   00_INVESTIDURA  Grupo Popular     españoles     23\n",
      "6   00_INVESTIDURA  Grupo Popular      historia     22\n",
      "7   00_INVESTIDURA  Grupo Popular   investidura     20\n",
      "8   00_INVESTIDURA  Grupo Popular    socialista     18\n",
      "9   00_INVESTIDURA  Grupo Popular         puede     18\n",
      "10  00_INVESTIDURA  Grupo Popular         pacto     18\n",
      "11  00_INVESTIDURA  Grupo Popular     electoral     17\n",
      "12  00_INVESTIDURA  Grupo Popular      libertad     17\n",
      "13  00_INVESTIDURA  Grupo Popular         decía     16\n",
      "14  00_INVESTIDURA  Grupo Popular           ley     16\n",
      "         rel.pleno        d.grupo     p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Popular       sánchez     59\n",
      "1   00_INVESTIDURA  Grupo Popular        españa     55\n",
      "2   00_INVESTIDURA  Grupo Popular       partido     40\n",
      "3   00_INVESTIDURA  Grupo Popular      gobierno     40\n",
      "4   00_INVESTIDURA  Grupo Popular  constitución     26\n",
      "5   00_INVESTIDURA  Grupo Popular     españoles     23\n",
      "6   00_INVESTIDURA  Grupo Popular      historia     22\n",
      "7   00_INVESTIDURA  Grupo Popular   investidura     20\n",
      "8   00_INVESTIDURA  Grupo Popular    socialista     18\n",
      "9   00_INVESTIDURA  Grupo Popular         puede     18\n",
      "10  00_INVESTIDURA  Grupo Popular         pacto     18\n",
      "11  00_INVESTIDURA  Grupo Popular     electoral     17\n",
      "12  00_INVESTIDURA  Grupo Popular      libertad     17\n",
      "13  00_INVESTIDURA  Grupo Popular         decía     16\n",
      "14  00_INVESTIDURA  Grupo Popular           ley     16\n",
      "Grupo Republicano\n",
      "         rel.pleno            d.grupo    p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Republicano     cataluña     20\n",
      "1   00_INVESTIDURA  Grupo Republicano     política     15\n",
      "2   00_INVESTIDURA  Grupo Republicano  republicana     14\n",
      "3   00_INVESTIDURA  Grupo Republicano     esquerra     14\n",
      "4   00_INVESTIDURA  Grupo Republicano         años     13\n",
      "5   00_INVESTIDURA  Grupo Republicano         psoe     13\n",
      "6   00_INVESTIDURA  Grupo Republicano       españa     13\n",
      "7   00_INVESTIDURA  Grupo Republicano      diálogo     13\n",
      "8   00_INVESTIDURA  Grupo Republicano      sánchez     11\n",
      "9   00_INVESTIDURA  Grupo Republicano         país      9\n",
      "10  00_INVESTIDURA  Grupo Republicano        claro      9\n",
      "11  00_INVESTIDURA  Grupo Republicano     gobierno      9\n",
      "12  00_INVESTIDURA  Grupo Republicano      acuerdo      9\n",
      "13  00_INVESTIDURA  Grupo Republicano     historia      8\n",
      "14  00_INVESTIDURA  Grupo Republicano          vez      8\n",
      "         rel.pleno            d.grupo    p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Republicano     cataluña     20\n",
      "1   00_INVESTIDURA  Grupo Republicano     política     15\n",
      "2   00_INVESTIDURA  Grupo Republicano  republicana     14\n",
      "3   00_INVESTIDURA  Grupo Republicano     esquerra     14\n",
      "4   00_INVESTIDURA  Grupo Republicano         años     13\n",
      "5   00_INVESTIDURA  Grupo Republicano         psoe     13\n",
      "6   00_INVESTIDURA  Grupo Republicano       españa     13\n",
      "7   00_INVESTIDURA  Grupo Republicano      diálogo     13\n",
      "8   00_INVESTIDURA  Grupo Republicano      sánchez     11\n",
      "9   00_INVESTIDURA  Grupo Republicano         país      9\n",
      "10  00_INVESTIDURA  Grupo Republicano        claro      9\n",
      "11  00_INVESTIDURA  Grupo Republicano     gobierno      9\n",
      "12  00_INVESTIDURA  Grupo Republicano      acuerdo      9\n",
      "13  00_INVESTIDURA  Grupo Republicano     historia      8\n",
      "14  00_INVESTIDURA  Grupo Republicano          vez      8\n",
      "Grupo Socialista\n",
      "         rel.pleno           d.grupo     p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Socialista       partido    272\n",
      "1   00_INVESTIDURA  Grupo Socialista      gobierno    270\n",
      "2   00_INVESTIDURA  Grupo Socialista        españa    234\n",
      "3   00_INVESTIDURA  Grupo Socialista    socialista    140\n",
      "4   00_INVESTIDURA  Grupo Socialista          país    113\n",
      "5   00_INVESTIDURA  Grupo Socialista      política     96\n",
      "6   00_INVESTIDURA  Grupo Socialista       popular     88\n",
      "7   00_INVESTIDURA  Grupo Socialista        casado     87\n",
      "8   00_INVESTIDURA  Grupo Socialista  ultraderecha     79\n",
      "9   00_INVESTIDURA  Grupo Socialista     coalición     79\n",
      "10  00_INVESTIDURA  Grupo Socialista    elecciones     78\n",
      "11  00_INVESTIDURA  Grupo Socialista         dicho     77\n",
      "12  00_INVESTIDURA  Grupo Socialista     españoles     75\n",
      "13  00_INVESTIDURA  Grupo Socialista   progresista     73\n",
      "14  00_INVESTIDURA  Grupo Socialista       abascal     68\n",
      "         rel.pleno           d.grupo     p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Socialista       partido    272\n",
      "1   00_INVESTIDURA  Grupo Socialista      gobierno    270\n",
      "2   00_INVESTIDURA  Grupo Socialista        españa    234\n",
      "3   00_INVESTIDURA  Grupo Socialista    socialista    140\n",
      "4   00_INVESTIDURA  Grupo Socialista          país    113\n",
      "5   00_INVESTIDURA  Grupo Socialista      política     96\n",
      "6   00_INVESTIDURA  Grupo Socialista       popular     88\n",
      "7   00_INVESTIDURA  Grupo Socialista        casado     87\n",
      "8   00_INVESTIDURA  Grupo Socialista  ultraderecha     79\n",
      "9   00_INVESTIDURA  Grupo Socialista     coalición     79\n",
      "10  00_INVESTIDURA  Grupo Socialista    elecciones     78\n",
      "11  00_INVESTIDURA  Grupo Socialista         dicho     77\n",
      "12  00_INVESTIDURA  Grupo Socialista     españoles     75\n",
      "13  00_INVESTIDURA  Grupo Socialista   progresista     73\n",
      "14  00_INVESTIDURA  Grupo Socialista       abascal     68\n",
      "Grupo Vasco\n",
      "         rel.pleno      d.grupo    p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Vasco     gobierno     36\n",
      "1   00_INVESTIDURA  Grupo Vasco      acuerdo     18\n",
      "2   00_INVESTIDURA  Grupo Vasco          ley     15\n",
      "3   00_INVESTIDURA  Grupo Vasco        puede     15\n",
      "4   00_INVESTIDURA  Grupo Vasco      navarra     13\n",
      "5   00_INVESTIDURA  Grupo Vasco     política     13\n",
      "6   00_INVESTIDURA  Grupo Vasco    candidato     11\n",
      "7   00_INVESTIDURA  Grupo Vasco      partido     11\n",
      "8   00_INVESTIDURA  Grupo Vasco          así     11\n",
      "9   00_INVESTIDURA  Grupo Vasco        cosas     10\n",
      "10  00_INVESTIDURA  Grupo Vasco  investidura     10\n",
      "11  00_INVESTIDURA  Grupo Vasco       españa     10\n",
      "12  00_INVESTIDURA  Grupo Vasco      momento      9\n",
      "13  00_INVESTIDURA  Grupo Vasco        parte      9\n",
      "14  00_INVESTIDURA  Grupo Vasco     realidad      8\n",
      "         rel.pleno      d.grupo    p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Vasco     gobierno     36\n",
      "1   00_INVESTIDURA  Grupo Vasco      acuerdo     18\n",
      "2   00_INVESTIDURA  Grupo Vasco          ley     15\n",
      "3   00_INVESTIDURA  Grupo Vasco        puede     15\n",
      "4   00_INVESTIDURA  Grupo Vasco      navarra     13\n",
      "5   00_INVESTIDURA  Grupo Vasco     política     13\n",
      "6   00_INVESTIDURA  Grupo Vasco    candidato     11\n",
      "7   00_INVESTIDURA  Grupo Vasco      partido     11\n",
      "8   00_INVESTIDURA  Grupo Vasco          así     11\n",
      "9   00_INVESTIDURA  Grupo Vasco        cosas     10\n",
      "10  00_INVESTIDURA  Grupo Vasco  investidura     10\n",
      "11  00_INVESTIDURA  Grupo Vasco       españa     10\n",
      "12  00_INVESTIDURA  Grupo Vasco      momento      9\n",
      "13  00_INVESTIDURA  Grupo Vasco        parte      9\n",
      "14  00_INVESTIDURA  Grupo Vasco     realidad      8\n",
      "Grupo Vox\n",
      "         rel.pleno    d.grupo      p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Vox        sánchez     44\n",
      "1   00_INVESTIDURA  Grupo Vox         españa     43\n",
      "2   00_INVESTIDURA  Grupo Vox      españoles     42\n",
      "3   00_INVESTIDURA  Grupo Vox       gobierno     41\n",
      "4   00_INVESTIDURA  Grupo Vox        partido     22\n",
      "5   00_INVESTIDURA  Grupo Vox     socialista     20\n",
      "6   00_INVESTIDURA  Grupo Vox         cámara     16\n",
      "7   00_INVESTIDURA  Grupo Vox         cierto     16\n",
      "8   00_INVESTIDURA  Grupo Vox      soberanía     15\n",
      "9   00_INVESTIDURA  Grupo Vox     elecciones     13\n",
      "10  00_INVESTIDURA  Grupo Vox      diputados     12\n",
      "11  00_INVESTIDURA  Grupo Vox  instituciones     11\n",
      "12  00_INVESTIDURA  Grupo Vox          decir     11\n",
      "13  00_INVESTIDURA  Grupo Vox    socialistas     11\n",
      "14  00_INVESTIDURA  Grupo Vox          poder     11\n",
      "         rel.pleno    d.grupo      p.palabra  veces\n",
      "0   00_INVESTIDURA  Grupo Vox        sánchez     44\n",
      "1   00_INVESTIDURA  Grupo Vox         españa     43\n",
      "2   00_INVESTIDURA  Grupo Vox      españoles     42\n",
      "3   00_INVESTIDURA  Grupo Vox       gobierno     41\n",
      "4   00_INVESTIDURA  Grupo Vox        partido     22\n",
      "5   00_INVESTIDURA  Grupo Vox     socialista     20\n",
      "6   00_INVESTIDURA  Grupo Vox         cámara     16\n",
      "7   00_INVESTIDURA  Grupo Vox         cierto     16\n",
      "8   00_INVESTIDURA  Grupo Vox      soberanía     15\n",
      "9   00_INVESTIDURA  Grupo Vox     elecciones     13\n",
      "10  00_INVESTIDURA  Grupo Vox      diputados     12\n",
      "11  00_INVESTIDURA  Grupo Vox  instituciones     11\n",
      "12  00_INVESTIDURA  Grupo Vox          decir     11\n",
      "13  00_INVESTIDURA  Grupo Vox    socialistas     11\n",
      "14  00_INVESTIDURA  Grupo Vox          poder     11\n"
     ]
    }
   ],
   "source": [
    "historico = []\n",
    "for ix, sesion in sesiones.iterrows():\n",
    "    historico.append(sesion['sesion'])\n",
    "    print(\"SESION...... \" + sesion['sesion'])\n",
    "    for gr in grupos_parlamentarios:\n",
    "        print(gr)\n",
    "        palabras_mas_dichas = lista_palabras(gr, [sesion['sesion']])\n",
    "        palabras_mas_dichas_hist = lista_palabras(gr, historico)       \n",
    "        print(palabras_mas_dichas)\n",
    "        print(palabras_mas_dichas_hist)\n",
    "\n",
    "    break\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n",
      "Grupo Socialista\n"
     ]
    }
   ],
   "source": [
    "for gupo in grupos_parlamentarios:\n",
    "    print(grupo)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "list"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(grupos_parlamentarios)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
